Revit 2027 API
SolidSolidCutUtils.SplitFacesOfCuttingSolid Method
 Causes the faces of the cutting element where it intersects the element it is cutting to be split or unsplit.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static void SplitFacesOfCuttingSolid(
	Element first,
	Element second,
	bool split
)
Public Shared Sub SplitFacesOfCuttingSolid (
	first As Element,
	second As Element,
	split As Boolean
)
public:
static void SplitFacesOfCuttingSolid(
	Element^ first,
	Element^ second,
	bool split
)
static member SplitFacesOfCuttingSolid :
        first : Element *
        second : Element *
        split : bool -> unit
Parameters
first Element
 The solid being cut or the cutting solid
second Element
 The solid being cut or the cutting solid
split Boolean
 True to split the faces of intersection, false to unsplit them.
Exceptions
Exception | Condition
ArgumentException |  There is no solid-solid cut between the input elements.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  Unable to split or unsplit faces of cutting solid
Remarks
 There must be a cut between the input elements.
See Also
Reference
SolidSolidCutUtils Class
Autodesk.Revit.DB Namespace